Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.NoPhysicalElementsLeftInExistingRelationship
There are no Physical elements left in the existing relationship.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.NoElementsLeftInExistingRelationship
There are no elements left in the existing relationship.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.NoAnalyticalElemensLeftInExistingRelationship
There are no Analytical elements left in the existing relationship.